# Задача 6: Вы пользуетесь общественным транспортом? 
# Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый,
# т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

n = int(input("Введите номер билета: "))

n1 = n // 100000 # нашли первую цифру

n2 = (n // 10000) % 10 # нашили вторую цифру

n3 = (n // 1000) % 10 # нашили третью цифру
n4 = (n % 1000) // 100 # нашили четвертую цифру
n5 = (n % 100) // 10 # нашили пятую цифру
n6 = n % 10 # нашили шестую цифру

if n1 + n2 + n3 == n4 + n5 + n6:
    print('yes')
else:
    print('no')    